Tekla Open API Reference for Tekla Structures 2025
CastUnitDrawing Constructor (Identifier, CastUnitDrawing.CastUnitDrawingCreationType)
 Instantiates a new cast unit drawing with standard attributes for a given cast unit.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CastUnitDrawing(
	Identifier castUnitIdentifier,
	CastUnitDrawing.CastUnitDrawingCreationType castUnitDrawingCreationType
)
Public Sub New (
	castUnitIdentifier As Identifier,
	castUnitDrawingCreationType As CastUnitDrawing.CastUnitDrawingCreationType
)
Parameters
castUnitIdentifier
Type: Tekla.Structures.Identifier
The identifier of the model object cast unit.
castUnitDrawingCreationType
Type: Tekla.Structures.Drawing.CastUnitDrawing.CastUnitDrawingCreationType
Specifies the cast unit drawing creation type (by cast unit id or by cast unit position).
See Also
Reference
CastUnitDrawing Class
CastUnitDrawing Overload
Tekla.Structures.Drawing Namespace